package com.example.Enum;

public enum DevelopmentStage {
    CONCEPT,           // Идея сформирована // создана сущность фильм
    SCRIPT_WRITING,    // Написание сценария // создана сущность сценария
    PRE_PRODUCTION,    // Подготовка к съемкам // выставление заявок на работу для членов сьемочной группы
    CASTING,           // Подбор актеров // когда начато кастинг актеров
    FILMING,           // Съемочный процесс // когда созданы сущности сьемочных дней
    POST_PRODUCTION,   // Монтаж и обработка //
    DISTRIBUTION,      // Распространение и маркетинг
    RELEASED           // Фильм выпущен
}
