package com.example.Enum;

public enum Genre {
    ACTION,         // Боевик – фильмы с динамичными сценами, драками, погонями, взрывами.
    ADVENTURE,      // Приключения – путешествия, исследования, экзотические локации.
    ANIMATION,      // Анимация – мультфильмы, CGI-анимация, как для детей, так и для взрослых.
    BIOGRAPHY,      // Биография – основаны на реальных людях и их жизни.
    COMEDY,         // Комедия – юмористические фильмы, чтобы рассмешить зрителя.
    CRIME,          // Криминал – про преступления, мафию, грабежи, расследования.
    DOCUMENTARY,    // Документальный – основаны на реальных событиях, фактах, интервью.
    DRAMA,          // Драма – эмоциональные и глубокие истории, часто с конфликтами и моралью.
    FAMILY,         // Семейный – фильмы, подходящие для просмотра всей семьей.
    FANTASY,        // Фэнтези – вымышленные миры, магия, мифические существа.
    FILM_NOIR,      // Фильм-нуар – стиль 40-50-х годов: мрачные детективы, моральная неоднозначность.
    HISTORY,        // Исторический – основаны на событиях прошлого, часто воссоздают эпоху.
    HORROR,         // Ужасы – цель напугать зрителя, присутствуют монстры, призраки и т.д.
    MUSIC,          // Музыкальный – фокус на музыке, часто с выступлениями и песнями.
    MUSICAL,        // Мюзикл – персонажи поют и танцуют, музыка часть сюжета.
    MYSTERY,        // Детектив/Загадка – расследования, тайны, неожиданные повороты.
    ROMANCE,        // Романтика – фокус на любви и отношениях между персонажами.
    SCI_FI,         // Научная фантастика – будущее, технологии, космос, киберпанк.
    SHORT,          // Короткометражка – фильмы с малым хронометражем (до 40 минут).
    SPORT,          // Спорт – истории о спортсменах, соревнованиях, преодолении трудностей.
    SUPERHERO,      // Супергерои – персонажи с суперспособностями, спасают мир.
    THRILLER,       // Триллер – напряжённая атмосфера, опасность, интрига.
    WAR,            // Военный – про войны, сражения, военную тематику.
    WESTERN,        // Вестерн – ковбои, Дикий Запад, шерифы и дуэли.
    OTHER           // Другой вид жанра введенный пользователем
}
